Repository: Kolger/forty-two
Catalog: locales/*/LC_MESSAGES/fortytwo.po
Languages: ca, es, ru

source: Something went wrong with the AI provider during processing text. Please try again later.
ca: S'ha produït un error amb el proveïdor d'IA durant el processament del text. Si us plau, torneu-ho a provar més tard.
es: Algo salió mal con el proveedor de IA durante el procesamiento del texto. Por favor, inténtalo de nuevo más tarde.
ru: Что-то пошло не так с ИИ-провайдером при обработке текста. Попробуйте позже.

source: This provider does not support images.
ca: Aquest proveïdor no admet imatges.
es: Este proveedor no soporta imágenes.
ru: Этот провайдер не поддерживает изображения.

source: Something went wrong with the AI provider during processing images. Please try again later.
ca: S'ha produït un error amb el proveïdor d'IA durant el processament d'imatges. Si us plau, torneu-ho a provar més tard.
es: Algo salió mal con el proveedor de IA durante el procesamiento de imágenes. Por favor, inténtalo de nuevo más tarde.
ru: Что-то пошло не так с ИИ-провайдером при обработке изображений. Попробуйте позже.

source: Start the bot
ca: Inicia el bot
es: Iniciar el bot
ru: Запустить бота

source: Reset the bot
ca: Reinicia el bot
es: Reiniciar el bot
ru: Сбросить диалог

source: Summarize the dialog
ca: Resumeix el diàleg
es: Resumir el diálogo
ru: Суммировать диалог

source: Set the AI provider
ca: Estableix el proveïdor d'IA
es: Establecer el proveedor de IA
ru: Установить ИИ-провайдера

source: Hello! Send me a message and I will try to help you. You can also send me images. To change to AI Provider use /provider command To clear your dialog history use /reset command
ca: Hola! Envia'm un missatge i intentaré ajudar-te. També em pots enviar imatges. Per canviar de proveïdor d'IA utilitza la comanda /provider Per esborrar el teu historial de diàleg utilitza la comanda /reset
es: Hola! Envíame un mensaje y trataré de ayudarte. También puedes enviarme imágenes. Para cambiar de proveedor de IA usa el comando /provider Para borrar tu historial de diálogo usa el comando /reset
ru: Здравствуйте! Отправьте мне сообщение и я попробую вам помочь. Вы также можете отправить мне изображения. Для смены ИИ-провайдера используйте команду /provider. Для очистки истории диалога используйте команду /reset.

source: Your dialog history has been cleared.
ca: El teu historial de diàleg s'ha esborrat.
es: Tu historial de diálogo ha sido borrado.
ru: История вашего диалога была очищена.

source: Processing...
ca: Processant...
es: Procesando...
ru: Обработка...

source: Your current provider is *{provider}*
ca: El teu proveïdor actual és *{provider}*
es: Tu proveedor actual es *{provider}*
ru: Ваш текущий ИИ - *{provider}*

source: Answer from *{provider_name}*: {answer}
ca: Resposta de *{provider_name}*: {answer}
es: Respuesta de *{provider_name}*: {answer}
ru: Ответ от *{provider_name}*: {answer}

source: Ask another AI
ca: Pregunta a una altra IA
es: Preguntar a otra IA
ru: Спросить у другого ИИ

source: Your current provider is *{provider}* Select new provider
ca: El teu proveïdor actual és *{provider}* Selecciona un nou proveïdor
es: Tu proveedor actual es *{provider}* Selecciona un nuevo proveedor
ru: Ваш текущий ИИ - *{provider}* Выберите нового ИИ

source: The operation took too long and was canceled. If the problem persists, please try to change a different AI provider with /provider command.
ca: L'operació ha trigat massa i s'ha cancel·lat. Si el problema persisteix, prova de canviar a un altre proveïdor d'IA amb la comanda /provider.
es: La operación tardó demasiado y fue cancelada. Si el problema persiste, prueba a cambiar a otro proveedor de IA con el comando /provider.

source: *❗️❗️❗️ BOT:* Your previous conversation history has been reseted because last message was more than {minutes} minutes ago.
ca: *❗️❗️❗️ BOT:* El teu historial de conversa anterior s'ha reiniciat perquè l'últim missatge era de fa més de {minutes} minuts.
es: *❗️❗️❗️ BOT:* Tu historial de conversación previo ha sido reiniciado porque el último mensaje fue hace más de {minutes} minutos.
ru: *❗️❗️❗️ БОТ:*: Ваша предыдущая история разговора была сброшена, потому что последнее сообщение было более {minutes} минут назад.

source: You don't have access to a bot. Please contact the administrator.
ca: No tens accés a un bot. Si us plau, contacta amb l'administrador.
es: No tienes acceso a un bot. Por favor, contacta al administrador.
ru: У вас нет доступа к боту. Пожалуйста, свяжитесь с администратором.

source: *Your dialog was summorized:* {sum_results}
ca: *El teu diàleg s'ha resumit:* {sum_results}
es: *Tu diálogo fue resumido:* {sum_results}
ru: *Ваш диалог был суммирован:* {sum_results}

source: The operation took too long and was canceled.
ru: Операция заняла слишком много времени и была отменена.
